rails-backend/app/controllers/clients_controller.rb

  def index
    clients = Client.page(params[:page]).per(10)
---
SELECT "clients".* FROM "clients" LIMIT 10 OFFSET 0

  def show
    client = Client.includes(:journal_entries).find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = NULL LIMIT 1
SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."client_id" = 1

  def providers
    client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

  def create
    client = Client.new(client_params)
    if client.save
---
INSERT INTO "clients" ("name", "email", "plan", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "New Client"], ["email", "[FILTERED]"], ["plan", "basic"], ["created_at", "2024-10-15 15:56:12.314282"], ["updated_at", "2024-10-15 15:56:12.314282"]]

  def update
    client = Client.find(params[:id])
    if client.update(client_params)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
UPDATE "clients" SET "name" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "Updated Name"], ["updated_at", "2024-10-15 15:56:11.969710"], ["id", 980190962]]

  def destroy
    client = Client.find(params[:id])
    client.destroy
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 980190962]]