rails-backend/app/controllers/journal_entries_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 3 LIMIT 1
SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."client_id" = 3 ORDER BY "journal_entries"."created_at" DESC LIMIT 10 OFFSET 0
---
  def index
    client = Client.find(params[:client_id])
    journal_entries = client.journal_entries.order(created_at: :desc).page(params[:page]).per(10)

SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    journal_entry = JournalEntry.find(params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
INSERT INTO "journal_entries" ("content", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "New Entry"], ["client_id", 980190962], ["created_at", "2024-10-15 15:56:12.322282"], ["updated_at", "2024-10-15 15:56:12.322282"]]
---
  def create
    client = Client.find(params[:client_id])
    journal_entry = client.journal_entries.new(journal_entry_params)

    if journal_entry.save

SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
UPDATE "journal_entries" SET "content" = ?, "updated_at" = ? WHERE "journal_entries"."id" = ?  [["content", "Updated Content"], ["updated_at", "2024-10-15 15:56:12.319140"], ["id", 980190962]]
---
  def update
    journal_entry = JournalEntry.find(params[:id])

    if journal_entry.update(journal_entry_params)

SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "journal_entries" WHERE "journal_entries"."id" = ?  [["id", 980190962]]
---
  def destroy
    journal_entry = JournalEntry.find(params[:id])
    journal_entry.destroy