rails-backend/app/controllers/providers_controller.rb

SELECT "providers".* FROM "providers" LIMIT 10 OFFSET 0
---
  def index
    providers = Provider.page(params[:page]).per(10)

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ?  [["id", 980190962]]
SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    provider = Provider.includes(:clients).find(params[:id])

SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def clients
    provider = Provider.find(params[:id])

SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "journal_entries".* FROM "journal_entries" INNER JOIN "clients" ON "clients"."id" = "journal_entries"."client_id" WHERE "clients"."id" = ? ORDER BY "journal_entries"."created_at" DESC  [["id", 980190962]]
---
  def all_journal_entries
    provider = Provider.find(params[:id])
    journal_entries = JournalEntry.joins(:client).where(clients: { id: provider.clients.ids }).order(created_at: :desc)

INSERT INTO "providers" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "New Provider"], ["email", "[FILTERED]"], ["created_at", "2024-10-15 15:56:12.485030"], ["updated_at", "2024-10-15 15:56:12.485030"]]
---
  def create
    provider = Provider.new(provider_params)
    if provider.save

SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
UPDATE "providers" SET "name" = ?, "updated_at" = ? WHERE "providers"."id" = ?  [["name", "Updated Name"], ["updated_at", "2024-10-15 15:56:12.388923"], ["id", 980190962]]
---
  def update
    provider = Provider.find(params[:id])
    if provider.update(provider_params)

SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "providers" WHERE "providers"."id" = ?  [["id", 980190962]]
---
  def destroy
    provider = Provider.find(params[:id])
    provider.destroy